ggg_app/app/controllers/matches_controller.rb

  def index
    @all_matches = Match.find( :all, :order => "DATE(date) ASC")
    @fixtures = Match.find( :all, :conditions => ['date >= ?', Date.today], :order => "date ASC")

    if params[:q]
      @matches = Match.search(params[:q])
    else
      @matches = Match.all
---
SELECT "matches".* FROM "matches"