ggg_app/app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams"
SELECT "matches".* FROM "matches"
---
  def index
    @teams = Team.all
    @matches = Match.all

SELECT "matches".* FROM "matches"
SELECT "teams".* FROM "teams"
SELECT  "teams".* FROM "teams"  WHERE "teams"."id" = $1 LIMIT 1
SELECT  "matches".* FROM "matches"  WHERE "matches"."hometeam_id" = 1 LIMIT 5
SELECT  "matches".* FROM "matches"  WHERE "matches"."awayteam_id" = 1 LIMIT 5
SELECT "matches".* FROM "matches"  WHERE "matches"."id" IN (31, 51, 71, 111, 131, 151, 171, 201, 221, 241, 261, 281, 301, 321, 331, 351, 371, 1, 91, 14, 24, 41, 62, 87, 108, 129, 149, 163, 190, 197, 215, 238, 253, 274, 295, 311, 343, 363) AND (date >= '2014-11-11')
SELECT  "matches".* FROM "matches"  WHERE "matches"."id" IN (31, 51, 71, 111, 131, 151, 171, 201, 221, 241, 261, 281, 301, 321, 331, 351, 371, 1, 91, 14, 24, 41, 62, 87, 108, 129, 149, 163, 190, 197, 215, 238, 253, 274, 295, 311, 343, 363) AND (date < '2014-11-11') LIMIT 10
---
  def show

    @matches = Match.all
    @teams = Team.all
    @team_page = Team.find(params[:id])

    @home_games = Match.where(hometeam_id: (params[:id])).limit(5).sort_by &:date
    @away_games = Match.where(awayteam_id: (params[:id])).limit(5).sort_by &:date

    @all_games = @team_page.matches.where(['date >= ?', Date.today]).sort_by &:date

    @all_results = @team_page.matches.where(['date < ?', Date.today]).limit(10).sort_by &:date